[
  {
    "title": "정보시스템 기반 기술",
    "comments": [
      {
        "problem_number": 1,
        "comment": "재사용이 불가능하도록 설계해야 한다."
      },
      {
        "problem_number": 2,
        "comment": "편리한 유지보수를 위해 개발자 중심으로 설계되어야 한다."
      },
      {
        "problem_number": 3,
        "comment": "새로 반입된 프로그램을 주기억장치의 어디에 위치시킬 것인 가를 결정하는 전략이다."
      },
      {
        "problem_number": 4,
        "comment": "문항은 \"OSI 7계층 중 데이터 링크 계층의 프로토콜에 해당하지 않는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 UDP입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 5,
        "comment": "문항은 \"디렉터리 구조 중 중앙에 마스터 파일 디렉터리가 있고, 그 아래에 사용자별로 서로 다른 파일 디렉터리가 있는 구조는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 2단계 디렉터리 구조입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 6,
        "comment": "문항은 \"한 객체의 상태가 변화하면 객체에 상속되어 있는 다른 객체들에게 변화된 상태를 전달하는 패턴은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Observer입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 7,
        "comment": "프로그램을 가변적인 크기의 논리적인 단위로 나눈다."
      },
      {
        "problem_number": 8,
        "comment": "정수의 변수로서 양의 값만을 가진다."
      },
      {
        "problem_number": 9,
        "comment": "객체 간의 결합도가 높아진다."
      },
      {
        "problem_number": 10,
        "comment": "문항은 \"UNIX 시스템에서 파일의 권한 모드 설정에 관한 명령어는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 chmod입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 11,
        "comment": "문항은 \"다음 중 빌드 자동화 도구가 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Fedora입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 12,
        "comment": "문항은 \"LAN의 한 종류인 100Base-T 네트워크에서 사용되는 전송 매체는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 UTP cable입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 13,
        "comment": "문항의 조건에 따라 계산 또는 규칙을 적용하면 결과값은 790입니다. 따라서 790를 고르는 것이 맞습니다."
      },
      {
        "problem_number": 14,
        "comment": "문항은 \"객체 지향 개념에서 이미 정의되어 있는 상위 클래스(수퍼 클래스 혹은 부모 클래스)의 메소드를 비롯한 모든 속성을 하위 클래스가 물려 받는 것을 무엇이라고 하는가?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Inheritance입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 15,
        "comment": "문항의 조건에 따라 계산 또는 규칙을 적용하면 결과값은 15입니다. 따라서 15를 고르는 것이 맞습니다."
      },
      {
        "problem_number": 16,
        "comment": "브로드캐스트, 유니캐스트, 멀티캐스트로 구성된다."
      },
      {
        "problem_number": 17,
        "comment": "문항은 \"관계 대수 중 순수 관계 연산이 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Difference입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 18,
        "comment": "문항은 \"기업의 소프트웨어 인프라인 정보 시스템을 공유와 재사용이 가능한 서비스 단위나 컴포넌트 중심으로 구축하는 정보기술 아키텍처는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 SOA입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 19,
        "comment": "문항은 \"루프 검사(Loop Test)에서 찾아볼 수 있는 4가지 반복 구조가 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 구조적 반복입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 20,
        "comment": "문항은 \"다음 중 가장 결합도가 강한 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Content Coupling입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      }
    ]
  },
  {
    "title": "프로그래밍 언어 활용",
    "comments": [
      {
        "problem_number": 21,
        "comment": "문항은 \"한 모듈이 다른 모듈의 내부 자료를 직접적으로 참조하는 경우의 결합도를 의미하는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 내용 결합도입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 22,
        "comment": "문항은 \"특정 모듈에 대해서 존재하는 처리 요소들 간의 기능적 연관성을 의미하는 것으로 입력이나 에러 처리 같은 유사한 기능을 행하는 요소끼리 하나의 요소로 묶는 응집도는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 논리적 응집도입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 23,
        "comment": "문항은 \"시스템 기능이나 설계, 구현 단계에서의 문제점 등으로 인해 시스템 이 가지게 되는 보안 취약점을 가리키는 용어는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Vulnerability입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 24,
        "comment": "문항은 \"다음 C언어의 함수 중 키보드로 문자 하나를 입력받아 변수에 저장하 는 함수는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 getchar( )입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 25,
        "comment": "라이브러리와 같이 객체들을 사용자가 직접 관리하고 통제해 야 한다."
      },
      {
        "problem_number": 26,
        "comment": "문항은 \"다음 중 빌드 도구가 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Zeplin입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 27,
        "comment": "문항은 \"자바스크립트에서 배열에 데이터를 입력하고자 할 때 사용하는 메소드는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 push입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 28,
        "comment": "㉠-method, ㉡-action"
      },
      {
        "problem_number": 29,
        "comment": "문항은 \"공통 모듈의 재사용 범위에 따른 분류가 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 더미코드 재사용입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 30,
        "comment": "문항은 \"스크립트 언어가 아닌 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Cobol입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 31,
        "comment": "모듈 간의 결합도는 강할수록 바람직하다."
      },
      {
        "problem_number": 32,
        "comment": "부모 클래스에서 상속받아 구체화한다."
      },
      {
        "problem_number": 33,
        "comment": "unsigned double e = -3.14"
      },
      {
        "problem_number": 34,
        "comment": "문항은 \"HTML5의 <input> 태그에서 반드시 입력되어야 할 필드를 만들 때 사용하는 속성은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 required입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 35,
        "comment": "문항의 조건에 따라 계산 또는 규칙을 적용하면 결과값은 8입니다. 따라서 8를 고르는 것이 맞습니다."
      },
      {
        "problem_number": 36,
        "comment": "문항은 \"다음 중 커서를 왼쪽으로 한 칸 이동하는 제어문자는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 ＼b입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 37,
        "comment": "문항은 \"정보 보안의 3대 요소에 해당하지 않는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 휘발성입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 38,
        "comment": "max = (a > b) ? a : b;"
      },
      {
        "problem_number": 39,
        "comment": "문항은 \"HTML이 호출될 때 자바스크립트를 이용하여 안내 문구를 전달하고 싶은 경우 사용할 수 있는 메소드는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 alert입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 40,
        "comment": "함수가 종료되면 값도 소멸된다."
      }
    ]
  },
  {
    "title": "데이터베이스의 활용",
    "comments": [
      {
        "problem_number": 41,
        "comment": "문항의 조건에 따라 계산 또는 규칙을 적용하면 결과값은 4입니다. 따라서 4를 고르는 것이 맞습니다."
      },
      {
        "problem_number": 42,
        "comment": "문항은 \"다음 중 교차곱을 의미하는 기호는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 ×입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 43,
        "comment": "문항은 \"릴레이션에 관한 설명 중 옳은 내용 모두를 나열한 것은? ㉠ 하나의 릴레이션에서 튜플의 순서는 존재한다. ㉡ 한 릴레이션에 나타난 속성 값은 논리적으로 분해 가 능한 값이어야 한다. ㉢ 한 릴레이션 내의 튜플은 중복 가능하다. ㉣ 각 속성은 릴레이션 내에서 유일한 이름을 가진다.\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 ㉣입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 44,
        "comment": "A B D C E G H F"
      },
      {
        "problem_number": 45,
        "comment": "뷰로 구성된 내용에 대하여 삽입, 삭제, 갱신 연산에 제약이 없다."
      },
      {
        "problem_number": 46,
        "comment": "문항은 \"제2정규형에서 제3정규형이 되기 위한 조건은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 이행 함수 종속 제거입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 47,
        "comment": "문항은 \"SQL 명령어 중 DDL에 해당하는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 ALTER입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 48,
        "comment": "문항은 \"삽입 정렬을 사용하여 다음의 자료를 오름차순으로 정렬하고자 한다. 2회전 후의 결과는? 5, 4, 3, 2, 1\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 3, 4, 5, 2, 1입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 49,
        "comment": "문항은 \"관계 데이터 모델에서 하나의 애트리뷰트(Attribute)가 취할 수 있는 모든 원자값들의 집합을 무엇이라고 하는가?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 도메인입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 50,
        "comment": "문항은 \"자료를 구조에 따라 분류할 경우, 성격이 나머지 셋과 다른 하나는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 그래프입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 51,
        "comment": "문항은 \"양쪽 끝에서 노드의 삽입과 삭제가 허용되는 선형 리스트는?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 데크(Deque)입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 52,
        "comment": "문항은 \"해싱에서 서로 다른 두 개 이상의 레코드가 동일한 주소를 갖는 현상을 의미하는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Collision입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 53,
        "comment": "GRANT SELECT ON STUDENT TO PUBLIC;"
      },
      {
        "problem_number": 54,
        "comment": "문항은 \"트랜잭션(Transaction)의 특성에 해당하지 않는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 Distribution입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 55,
        "comment": "문항은 \"한 릴레이션의 기본키를 구성하는 어떠한 속성 값도 널(null) 값이나 중복 값을 가질 수 없다는 것을 의미하는 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 개체 무결성 제약 조건입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 56,
        "comment": "문항은 \"SQL 문에서 테이블 생성에 사용되는 문장은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 CREATE입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 57,
        "comment": "문항은 \"개체-관계 모델의 E-R 다이어그램에서 속성을 의미하는 그래픽 표현은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 타원입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 58,
        "comment": "문항은 \"데이터베이스 설계 단계 중 물리적 설계 단계와 거리가 먼 것은?\"에 대한 이해를 묻고 있으며, 이에 해당하는 선택지는 스키마의 평가 및 정제입니다. 다른 선택지는 용어의 의미나 적용 범위가 달라 문제의 조건에 맞지 않습니다."
      },
      {
        "problem_number": 59,
        "comment": "무결성 확보를 위하여 일반 사용자는 내용을 검색할 수 없다."
      },
      {
        "problem_number": 60,
        "comment": "UPDATE 학생 SET 학년=“2” WHERE 학번=“1144077”;"
      }
    ]
  }
]
